#### Pandas

Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A series is a one dimensional array like object, while a DataFrame is a two dimensional, size-mutable and potentially heterogenous tabular data structure with labeled axes (rows and columns).

In [9]:
import pandas as pd
import numpy as np

#### Series
##### A series is a 1-D array like object that can hold any data type. It is similar to a column in a table.

In [5]:
data = [1, 2, 3, 4, 5]
series = pd.Series (data)
print (series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
## Creating a Series from a Dictionary
data = {'a': 1, 'b': 2, 'c': 3}
series = pd.Series (data)
print (series)

a    1
b    2
c    3
dtype: int64

In [7]:
data = [10, 20, 30]
series = pd.Series (data, index = ['x', 'y', 'z'])
print (series)

x    10
y    20
z    30
dtype: int64

In [ ]:
## DataFrame
## Create a DataFrame from a dictionary of list

data = {
    'Name': ['Vanshika', 'Aayush', 'Gourav'],
    'Age': [21, 22, 23],
    'City': ['Bikaner', 'Bhilwara', 'Brahmapur']
}
df = pd.DataFrame (data)
print (df)
print (type(df))

       Name  Age       City
0  Vanshika   21    Bikaner
1    Aayush   22   Bhilwara
2    Gourav   23  Bramhapur
<class 'pandas.core.frame.DataFrame'>

In [10]:
np.array (df)

array([['Vanshika', 21, 'Bikaner'],
       ['Aayush', 22, 'Bhilwara'],
       ['Gourav', 23, 'Bramhapur']], dtype=object)

In [12]:
# Creating a dataframe from a list of dictionaries

data = [
    {'Name': 'Vanshika', 'Age': 21, 'City': 'Bikaner'},
    {'Name': 'Aayush', 'Age': 22, 'City': 'Bhilwara'},
    {'Name': 'Gourav', 'Age': 23, 'City': 'Brahmapur'}
]
df = pd.DataFrame (data)
print (df)

       Name  Age       City
0  Vanshika   21    Bikaner
1    Aayush   22   Bhilwara
2    Gourav   23  Brahmapur

In [ ]:
# df = pd.read_csv ('data.csv')
# print (df.head())
# print (df.tail())

In [19]:
type(df['Name'])

pandas.core.series.Series

In [33]:
print (df.loc[0])
print (df.iloc[0][1])

Name    Vanshika
Age           21
City     Bikaner
Name: 0, dtype: object
21

/var/folders/_1/465jzgvx159dbqmnnz6lmpfm0000gn/T/ipykernel_4913/81423660.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print (df.iloc[0][1])

In [ ]:
## Accessing a specified element

# df['Name']
# df.at[1, 'Age']
# df.iat[0, 2]

'Bikaner'

In [ ]:
# adding new column salary
df['Salary'] = [50000, 50000, 40000]
df

       Name  Age       City  Salary
0  Vanshika   21    Bikaner   50000
1    Aayush   22   Bhilwara   50000
2    Gourav   23  Brahmapur   40000

In [45]:
# droping a column
df.drop ('Salary', axis=1, inplace=True)

In [49]:
df

       Name  Age       City
0  Vanshika   22    Bikaner
1    Aayush   23   Bhilwara
2    Gourav   24  Brahmapur

In [50]:
# add age to the column

df['Age'] = df['Age'] - 1
df

       Name  Age       City
0  Vanshika   21    Bikaner
1    Aayush   22   Bhilwara
2    Gourav   23  Brahmapur

In [55]:
# df.drop (2, inplace=True)
df.describe()

             Age
count   2.000000
mean   21.500000
std     0.707107
min    21.000000
25%    21.250000
50%    21.500000
75%    21.750000
max    22.000000